0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 3.978e-7;           

boundaryField
{
    
    side1
    {
        type            empty;
    }
    
    side2
    {
        type            empty;
    }
    
    outFlow
    {
        type            zeroGradient;
    }
    
    airfoil
    {
        type            nutUSpaldingWallFunction;
	value 		uniform 0;
    }
    
    inFlow
    {
        type            inletOutlet;
	inletValue 	uniform 3.978e-7;
    }
}



// ************************************************************************* //
